/***********************************************************************************************//**
 * @file        app_EEPROM_Control.h
 * @brief       app_EEPROM_Control
 * @date        AUG 29, 2022
 * @version     1.0.0
 * @author      KARRY.WANG
 *
 * Revision History
 *------------------------------------------------------------------------------------------------
 *|Version   |Date       |Author         |Change ID      |Description                            |
 *|----------|-----------|---------------|---------------|---------------------------------------|
 *|1.0.0     |2022.08.29 |KARRY.WANG     |00000000000    |Initial version created                |
 **************************************************************************************************/

#ifndef INC_APP_EEPROM_CONTROL_H_
#define INC_APP_EEPROM_CONTROL_H_
/*================================================================================================*=
 * INCLUDE FILES
 *================================================================================================*/
#include "main.h"

/*================================================================================================*=
 * LOCAL TYPEDEFS (STRUCTURES, UNIONS, ENUMS)
 *================================================================================================*/


/*================================================================================================*=
 * GLOBAL TYPEDEFS (STRUCTURES, UNIONS, ENUMS)
 *================================================================================================*/


/*================================================================================================*=
 * GLOBAL MACROS
 *================================================================================================*/
#define EE_W_ADDRESS     	 0xA0
#define EE_R_ADDRESS     	 0xA1
/*================================================================================================*=
 * GLOBAL CONSTANTS
 *================================================================================================*/


/*================================================================================================*=
 * GLOBAL VARIABLES
 *================================================================================================*/
extern I2C_HandleTypeDef hi2c1;

/*================================================================================================*=
 * GLOBAL FUNCTIONS
 *================================================================================================*/
extern void EE_Write_Byte(uint16_t addr,uint8_t data);
extern void EE_READ_BYTE(uint8_t AddStr ,uint8_t lenth ,uint8_t *data);
extern void EE_Write_T(void);
extern void EE_Read_T(void);
extern void EE_Init_Read(void);
extern void EE_READ_ALL(void);
/*================================================================================================*=
 * EEPROM MEMBER
 *================================================================================================*/
typedef struct{
	uint8_t		FW_VERSION_1;		/* 0  */
	uint8_t		FW_VERSION_2;		/* 1  */
	uint8_t		FW_VERSION_3;		/* 2  */
	uint8_t		FW_VERSION_4;		/* 3  */
	uint8_t		FW_VERSION_5;		/* 4  */
	uint8_t 	AutoFlow_H;			/* 5  */
	uint8_t 	AutoFlow_L;			/* 6  */
	uint8_t 	AutoPres_H;			/* 7  */
	uint8_t 	AutoPres_L;			/* 8  */
	uint8_t 	AutoTemp_H;			/* 9 */
	uint8_t 	AutoTemp_L;			/* 10 */
	uint8_t 	ManualPumpDuty;		/* 11 */
	uint8_t 	ManualThreeWayDuty;	/* 12 */

	uint8_t 	Leakage_SET_SW;		/* 13 */
	uint8_t 	Leakage_ALM_SW;		/* 14 */
	uint8_t     PumpRedundantDay;	/* 15 */
	uint8_t     Pump1_Status;		/* 16 */
	uint8_t     Pump2_Status;		/* 17 */

	uint8_t 	Pump1_Day;			/* 18 */
	uint8_t 	Pump1_Hour;			/* 19 */
	uint8_t 	Pump1_Min;			/* 20 */
	uint8_t 	Pump1_Sec;			/* 21 */
	uint8_t 	Pump2_Day;			/* 22 */
	uint8_t 	Pump2_Hour;			/* 23 */
	uint8_t 	Pump2_Min;			/* 24 */
	uint8_t 	Pump2_Sec;			/* 25 */
	uint8_t     PumpRedundantSW;	/* 26 */
	uint8_t     FanTempSet;			/* 27 */
	uint8_t     FanDutySet;			/* 28 */
}EE_DATA;
extern EE_DATA EE;
/*================================================================================================*=
 * END OF FILE
 *================================================================================================*/
#endif /* INC_APP_EEPROM_CONTROL_H_ */
